<a href="https://colab.research.google.com/github/bagcakaya/Lab-10/blob/main/Lab_10.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import re
import pandas as pd

**SEARCH**

In [2]:
text = "A78L41K"

In [7]:
num=re.search("\d\d", text)
num

In [5]:
num.group(0)

'7'

In [8]:
text = "8PM19MIN"

In [11]:
nondigi=re.search("\D", text)
print(nondigi.group())

M

In [12]:
text = 'My phone number is 5556667777'

In [14]:
telno = re.search("\d\d\d\d\d\d\d\d\d\d", text)
print(telno.group())

5556667777

In [15]:
text = 'My phone number is 415-555-1212'

In [22]:
telno=re.search("(\d\d\d)-(\d\d\d)-(\d\d\d\d)", text)
print(telno.group(3))

1212

In [23]:
telno = re.search("\d"*3 + "-" + "\d"*3 + "-" + "\d"*4, text)
print(telno.group())

415-555-1212

In [25]:
with open("text.txt", "w") as file:
  file.write(text)

In [32]:
with open("text.txt", "r") as file:
  txt=file.read()
print(txt)

output=re.search("(\d\d\d)-(\d\d\d-\d\d\d\d)", txt)
print(output.group(1))
print(output.group(2))

My phone number is 415-555-1212
415
555-1212

In [33]:
value = "O 1, t 10, o 100. 100000"

In [35]:
output=re.findall("\d{1}", value)
print(output)

['1', '1', '0', '1', '0', '0', '1', '0', '0', '0', '0', '0']

In [39]:
phone = "2004-959-559"

In [42]:
output=re.sub("\D", " ", phone)
print(output)

2004 959 559

In [43]:
output=re.sub("\d", "~", phone)
print(output)

~~~~-~~~-~~~

### Special Characters
___
``"[]"``	  A set of characters	``"[a-m]"``
``"\"``	      Signals a special sequence (can also be used to escape special characters)
``"."``	      Any character (except newline character)
``"^"``	      Starts with	``"^hello"``
``"$"``	      Ends with	``"world$"``
``"*"``	      Zero or more occurrences
`"+"`	      One or more occurrences
`"{}"`	  Exactly the specified number of occurrences
`"|"`	      Either or	`"falls|stays"`
`"()"`	  Capture and group
___

In [44]:
txt = "1 person against 100 people"

In [45]:
output=re.findall("\d+", txt)
print(output)

['1', '100']

In [46]:
txt ="hello world"

In [47]:
oıtput=re.findall("^h", txt)
print(output)

['1', '100']

In [48]:
output = re.findall("world$",txt)
output

['world']

In [49]:
s = pd.Series(['a3', 'b4', 'c5', 'd'])

In [50]:
s.str.contains("(\d)")

/usr/local/lib/python3.7/dist-packages/pandas/core/strings.py:2001: UserWarning: This pattern has match groups. To actually get the groups, use str.extract.
  return func(self, *args, **kwargs)

0     True
1     True
2     True
3    False
dtype: bool

In [52]:
s.str.extract("(\d)")

     0
0    3
1    4
2    5
3  NaN

In [53]:
s.str.extract("(\w)")

   0
0  a
1  b
2  c
3  d

In [54]:
s = pd.Series(['a3aa', 'b4aa', 'c5aa'])

In [55]:
s.str.extract("(\w)")

   0
0  a
1  b
2  c

In [56]:
s = pd.Series(['a3aa', 'b4aa', 'c5aa'])

In [57]:
s.str.extract("(\w)\d(\w)(\w)")

   0  1  2
0  a  a  a
1  b  a  a
2  c  a  a

In [58]:
s= pd.Series(['40 l/100 km (comb)',
        '38 l/100 km (comb)', '6.4 l/100 km (comb)',
       '8.3 kg/100 km (comb)', '5.1 kg/100 km (comb)',
       '5.4 l/100 km (comb)', '6.7 l/100 km (comb)',
       '6.2 l/100 km (comb)', '7.3 l/100 km (comb)',
       '6.3 l/100 km (comb)', '5.7 l/100 km (comb)',
       '6.1 l/100 km (comb)', '6.8 l/100 km (comb)',
       '7.5 l/100 km (comb)', '7.4 l/100 km (comb)',
       '3.6 kg/100 km (comb)', '0 l/100 km (comb)',
       '7.8 l/100 km (comb)'])

In [59]:
s

0       40 l/100 km (comb)
1       38 l/100 km (comb)
2      6.4 l/100 km (comb)
3     8.3 kg/100 km (comb)
4     5.1 kg/100 km (comb)
5      5.4 l/100 km (comb)
6      6.7 l/100 km (comb)
7      6.2 l/100 km (comb)
8      7.3 l/100 km (comb)
9      6.3 l/100 km (comb)
10     5.7 l/100 km (comb)
11     6.1 l/100 km (comb)
12     6.8 l/100 km (comb)
13     7.5 l/100 km (comb)
14     7.4 l/100 km (comb)
15    3.6 kg/100 km (comb)
16       0 l/100 km (comb)
17     7.8 l/100 km (comb)
dtype: object

In [60]:
s.str.extract("(\d\d)")

     0
0   40
1   38
2   10
3   10
4   10
5   10
6   10
7   10
8   10
9   10
10  10
11  10
12  10
13  10
14  10
15  10
16  10
17  10

In [63]:
result=s.str.extract("(\d\d|\d.\d|\d)")
print(result)

      0
0    40
1    38
2   6.4
3   8.3
4   5.1
5   5.4
6   6.7
7   6.2
8   7.3
9   6.3
10  5.7
11  6.1
12  6.8
13  7.5
14  7.4
15  3.6
16    0
17  7.8

In [64]:
result=s.str.extract("(\d\d|\d.\d|\d).+(\d\d)")

In [65]:
result

      0   1
0    40  00
1    38  00
2   6.4  00
3   8.3  00
4   5.1  00
5   5.4  00
6   6.7  00
7   6.2  00
8   7.3  00
9   6.3  00
10  5.7  00
11  6.1  00
12  6.8  00
13  7.5  00
14  7.4  00
15  3.6  00
16    0  00
17  7.8  00

In [69]:
result=s.str.extract("(^\d*.\d*) \w*/(\d*)")
result

      0    1
0    40  100
1    38  100
2   6.4  100
3   8.3  100
4   5.1  100
5   5.4  100
6   6.7  100
7   6.2  100
8   7.3  100
9   6.3  100
10  5.7  100
11  6.1  100
12  6.8  100
13  7.5  100
14  7.4  100
15  3.6  100
16    0  100
17  7.8  100

In [70]:
result = s.str.extract('(\S+)\s+')
result

      0
0    40
1    38
2   6.4
3   8.3
4   5.1
5   5.4
6   6.7
7   6.2
8   7.3
9   6.3
10  5.7
11  6.1
12  6.8
13  7.5
14  7.4
15  3.6
16    0
17  7.8

In [71]:
s = pd.Series(['06/2020\n\n4.9 l/100 km (comb)',
'11/2020\n\n166 g CO2/km (comb)',
'10/2019\n\n5.3 l/100 km (comb)',
'05/2022\n\n6.3 l/100 km (comb)',
'07/2019\n\n128 g CO2/km (comb)',
'06/2022\n\n112 g CO2/km (comb)',
'01/2022\n\n5.8 l/100 km (comb)',
'11/2020\n\n106 g CO2/km (comb)',
'04/2019\n\n105 g CO2/km (comb)',
'08/2020\n\n133 g CO2/km (comb)',
'04/2022\n\n133 g CO2/km (comb)'])

In [73]:
result=s.str.extract("(\d+).(\d+)")
result

     0     1
0   06  2020
1   11  2020
2   10  2019
3   05  2022
4   07  2019
5   06  2022
6   01  2022
7   11  2020
8   04  2019
9   08  2020
10  04  2022